In [24]:
%matplotlib inline
#import sys
#reload(sys)
#sys.setdefaultencoding('utf-8')
import pandas as pd

In [25]:
from IPython.core.display import HTML
css = open(r"style-table.css").read() + open(r"style-notebook.css").read()
HTML('<style>{}</style>'.format(css))

In [26]:
titles = pd.DataFrame.from_csv(r"data/titles.csv", index_col=None)
titles.head()

                     title  year
0  The Symbol of Sacrifice  1918
1         Galactic Raiders  2004
2                  Haytabo  1971
3               Can pazari  1976
4                Bel amour  1951

In [27]:
cast = pd.DataFrame.from_csv(r"data/cast.csv", index_col=None)
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [28]:
#How many movies are listed in the titles dataframe?
len(titles)

244914

In [29]:
#What are the earliest two films listed in the titles dataframe?
#titles.head(2)
titles.sort_values('year').head(2)

                    title  year
37613          Miss Jerry  1894
27744  The Startled Lover  1898

In [30]:
#How many movies have the title "Hamlet"?
len(titles[titles.title == 'Hamlet'])

20

In [31]:
#How many movies are titled "North by Northwest"?
len(titles[titles.title == 'North by Northwest'])

1

In [32]:
#When was the first movie titled "Hamlet" made?
(titles[titles.title == 'Hamlet']).sort_values('year').head(1)

         title  year
194851  Hamlet  1910

In [33]:
#List all of the "Treasure Island" movies from earliest to most recent.
(titles[titles.title == 'Treasure Island']).sort_values('year')

                  title  year
60645   Treasure Island  1918
96850   Treasure Island  1920
54379   Treasure Island  1934
84352   Treasure Island  1950
84225   Treasure Island  1972
192092  Treasure Island  1973
135002  Treasure Island  1985
139233  Treasure Island  1999

In [34]:
#How many movies were made in the year 1950?
len(titles[titles.year == 1950])

1113

In [35]:
#How many movies were made in the year 1960
len(titles[titles.year == 1960])

1549

In [36]:
#How many movies were made from 1950 through 1959
len(titles[(titles.year >= 1950) & (titles.year <= 1960)])

14483

In [37]:
#In what years has a movie titled "Batman" been released?
titles[titles.title == 'Batman'].sort_values('year')

         title  year
45162   Batman  1943
152642  Batman  1989

In [38]:
#How many roles were there in the movie "Inception"?
# (1) look at the columns first
cast.head(1)

            title  year      name   type character     n
0  Closet Monster  2015  Buffy #1  actor   Buffy 4  31.0

In [39]:
#How many roles were there in the movie "Inception"?
# (2) i want to filter out based on the year as well, since Inception could be released in more than one year as a different version
year1 = cast[cast.title == 'Inception']['year'].head(1)
year1

98153    2010
Name: year, dtype: int64

In [40]:
#How many roles were there in the movie "Inception"?
# (3) final answer
len(cast[(cast.title == 'Inception') & (cast.year == 2010)])

78

In [41]:
#How many roles in the movie "Inception" are NOT ranked by an "n" value?
c1 = cast[cast.title == 'Inception']
len(c1[c1.n.isnull()])

27

In [42]:
#But how many roles in the movie "Inception" did receive an "n" value?
c1 = cast[cast.title == 'Inception']
len(c1[c1.n.notnull()])

51

In [43]:
#Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.
c1 = cast[cast.title =='North by Northwest']
c1[c1.n.notnull()].sort_values('n')

,title,year,name,type,character,n
871426,North by Northwest,1959,Cary Grant,actor,Roger O. Thornhill,1.0
3518333,North by Northwest,1959,Eva Marie Saint,actress,Eve Kendall,2.0
1457165,North by Northwest,1959,James Mason,actor,Phillip Vandamm,3.0
3157232,North by Northwest,1959,Jessie Royce Landis,actress,Clara Thornhill,4.0
356707,North by Northwest,1959,Leo G. Carroll,actor,The Professor,5.0
3048272,North by Northwest,1959,Josephine Hutchinson,actress,Mrs. Townsend,6.0
1695173,North by Northwest,1959,Philip Ober,actor,Lester Townsend,7.0
1275337,North by Northwest,1959,Martin Landau,actor,Leonard,8.0
2447081,North by Northwest,1959,Adam Williams,actor,Valerian,9.0
1811387,North by Northwest,1959,Edward Platt,actor,Victor Larrabee,10.0
665768,North by Northwest,1959,Robert Ellenstein,actor,Licht,11.0
2295714,North by Northwest,1959,Les Tremayne,actor,Auctioneer,12.0
464736,North by Northwest,1959,Philip Coolidge,actor,Dr. Cross,13.0
1508344,North by Northwest,1959,Patrick McVey,actor,Sergeant Flamm,14.0
206471,North by Northwest,1959,Edward Binns,actor,Captain Junket,15.0
1384780,North by Northwest,1959,Ken Lynch,actor,Charley - Chicago Policeman,16.0

In [44]:
#Display the entire cast, in "n"-order, of the 1972 film "Sleuth".
cast[(cast.title == 'Sleuth') & (cast.year == 1972)].sort_values('n')

,title,year,name,type,character,n
1705394,Sleuth,1972,Laurence Olivier,actor,Andrew Wyke,1.0
326773,Sleuth,1972,Michael Caine,actor,Milo Tindle,2.0
373876,Sleuth,1972,Alec Cawthorne,actor,Inspector Doppler,3.0
1465483,Sleuth,1972,John (II) Matthews,actor,Detective Sergeant Tarrant,4.0
2724553,Sleuth,1972,Eve (III) Channing,actress,Marguerite Wyke,5.0
1448690,Sleuth,1972,Teddy Martin,actor,Police Constable Higgs,6.0

In [45]:
#Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".
cast[(cast.title == 'Sleuth') & (cast.year == 2007)].sort_values('n')

          title  year                 name     type          character    n
326774   Sleuth  2007        Michael Caine    actor             Andrew  1.0
1293634  Sleuth  2007             Jude Law    actor               Milo  2.0
1805907  Sleuth  2007        Harold Pinter    actor        Man on T.V.  3.0
260242   Sleuth  2007      Kenneth Branagh    actor  Other Man on T.V.  NaN
373877   Sleuth  2007  Alec (II) Cawthorne    actor  Inspector Doppler  NaN
2724552  Sleuth  2007    Eve (II) Channing  actress    Marguerite Wyke  NaN
3370424  Sleuth  2007    Carmel O'Sullivan  actress             Maggie  NaN

In [46]:
#How many roles were credited in the silent 1921 version of Hamlet?
#cast.head(1)
len(cast[(cast.title == 'Hamlet') & (cast.year == 1921)])

9

In [47]:
#How many roles were credited in Branaghâ€™s 1996 Hamlet?
len(cast[(cast.title == 'Hamlet') & (cast.year == 1996)])

54

In [48]:
#AN Extra Question - name all Michael's who acted in 1996 Hamlet?
cast[(cast.title == 'Hamlet') & (cast.year == 1996) & (cast['name'].str.contains('Michael'))]

          title  year             name   type character     n
294652   Hamlet  1996   Michael Bryant  actor    Priest   7.0
1417360  Hamlet  1996  Michael Maloney  actor   Laertes  31.0

In [49]:
#How many "Hamlet" characters have been listed in all film credits through history?
len(cast[cast.character == 'Hamlet'])

96

In [50]:
#How many people have played an "Ophelia"?
len(cast[cast.character == 'Ophelia'].name.unique())

115

In [51]:
#How many people have played a character called "The Dude"?
len(cast[cast.character == 'The Dude'].name.unique())

19

In [52]:
#How many characters has Sidney Poitier played throughout his career?
len(cast[cast.name == 'Sidney Poitier'].character.unique())

41

In [53]:
#List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.
cast[(cast.name == 'Cary Grant') & (cast.n == 2) & (cast.year // 10 == 194)].sort_values('year')

                   title  year        name   type    character    n
871423  My Favorite Wife  1940  Cary Grant  actor   Nick Arden  2.0
871433    Penny Serenade  1941  Cary Grant  actor  Roger Adams  2.0

In [54]:
#How many roles were available for actors in the 1950s?
len(cast[(cast.year // 10 == 195) & (cast.type == 'actor')])

157738

In [55]:
#How many non-leading roles (n<>1) were available from the beginning of film history through 1980?
len(cast[(cast.year <= 1980) & (cast.n != 1)])

1117667

In [56]:
#How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?
len(cast[(cast.year <= 1980) & (cast.n.isnull())])

448347